turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U2E.atdf
        <register caption="Master Configuration Register 1" name="MATRIX_MCFG1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 2" name="MATRIX_MCFG2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 3" name="MATRIX_MCFG3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 4" name="MATRIX_MCFG4" offset="0x10" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Slave Configuration Register 0" name="MATRIX_SCFG0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 1" name="MATRIX_SCFG1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 2" name="MATRIX_SCFG2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 3" name="MATRIX_SCFG3" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 4" name="MATRIX_SCFG4" offset="0x50" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 5" name="MATRIX_SCFG5" offset="0x54" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 6" name="MATRIX_SCFG6" offset="0x58" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 7" name="MATRIX_SCFG7" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 8" name="MATRIX_SCFG8" offset="0x60" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 9" name="MATRIX_SCFG9" offset="0x64" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS0" offset="0x0080" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
