turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U2E.atdf
        <register caption="SMC Pulse Register (CS_number = 0)" name="SMC_PULSE0" offset="0x74" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000003F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00003F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x003F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x3F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 0)" name="SMC_CYCLE0" offset="0x78" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC Timings Register (CS_number = 0)" name="SMC_TIMINGS0" offset="0x7C" rw="RW" size="4">
          <bitfield caption="CLE to REN Low Delay" mask="0x0000000F" name="TCLR"/>
          <bitfield caption="ALE to Data Start" mask="0x000000F0" name="TADL"/>
          <bitfield caption="ALE to REN Low Delay" mask="0x00000F00" name="TAR"/>
          <bitfield caption="Off Chip Memory Scrambling Enable" mask="0x00001000" name="OCMS"/>
          <bitfield caption="Ready to REN Low Delay" mask="0x000F0000" name="TRR"/>
          <bitfield caption="WEN High to REN to Busy" mask="0x0F000000" name="TWB"/>
          <bitfield caption="Ready/Busy Line Selection" mask="0x70000000" name="RBNSEL"/>
          <bitfield caption="NAND Flash Selection" mask="0x80000000" name="NFSEL"/>
        </register>
        <register caption="SMC Mode Register (CS_number = 0)" name="SMC_MODE0" offset="0x80" rw="RW" size="4">
          <bitfield caption="" mask="0x00000001" name="READ_MODE" values="SMC_MODE0__READ_MODE"/>
          <bitfield caption="" mask="0x00000002" name="WRITE_MODE" values="SMC_MODE0__WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE0__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE0__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 1)" name="SMC_SETUP1" offset="0x84" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in Write Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in Read Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 1)" name="SMC_PULSE1" offset="0x88" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000003F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00003F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x003F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x3F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 1)" name="SMC_CYCLE1" offset="0x8C" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC Timings Register (CS_number = 1)" name="SMC_TIMINGS1" offset="0x90" rw="RW" size="4">
          <bitfield caption="CLE to REN Low Delay" mask="0x0000000F" name="TCLR"/>
          <bitfield caption="ALE to Data Start" mask="0x000000F0" name="TADL"/>
          <bitfield caption="ALE to REN Low Delay" mask="0x00000F00" name="TAR"/>
          <bitfield caption="Off Chip Memory Scrambling Enable" mask="0x00001000" name="OCMS"/>
          <bitfield caption="Ready to REN Low Delay" mask="0x000F0000" name="TRR"/>
          <bitfield caption="WEN High to REN to Busy" mask="0x0F000000" name="TWB"/>
          <bitfield caption="Ready/Busy Line Selection" mask="0x70000000" name="RBNSEL"/>
          <bitfield caption="NAND Flash Selection" mask="0x80000000" name="NFSEL"/>
        </register>
        <register caption="SMC Mode Register (CS_number = 1)" name="SMC_MODE1" offset="0x94" rw="RW" size="4">
          <bitfield caption="" mask="0x00000001" name="READ_MODE" values="SMC_MODE1__READ_MODE"/>
          <bitfield caption="" mask="0x00000002" name="WRITE_MODE" values="SMC_MODE1__WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE1__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE1__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 2)" name="SMC_SETUP2" offset="0x98" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in Write Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in Read Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
        <register caption="SMC Pulse Register (CS_number = 2)" name="SMC_PULSE2" offset="0x9C" rw="RW" size="4">
          <bitfield caption="NWE Pulse Length" mask="0x0000003F" name="NWE_PULSE"/>
          <bitfield caption="NCS Pulse Length in WRITE Access" mask="0x00003F00" name="NCS_WR_PULSE"/>
          <bitfield caption="NRD Pulse Length" mask="0x003F0000" name="NRD_PULSE"/>
          <bitfield caption="NCS Pulse Length in READ Access" mask="0x3F000000" name="NCS_RD_PULSE"/>
        </register>
        <register caption="SMC Cycle Register (CS_number = 2)" name="SMC_CYCLE2" offset="0xA0" rw="RW" size="4">
          <bitfield caption="Total Write Cycle Length" mask="0x000001FF" name="NWE_CYCLE"/>
          <bitfield caption="Total Read Cycle Length" mask="0x01FF0000" name="NRD_CYCLE"/>
        </register>
        <register caption="SMC Timings Register (CS_number = 2)" name="SMC_TIMINGS2" offset="0xA4" rw="RW" size="4">
          <bitfield caption="CLE to REN Low Delay" mask="0x0000000F" name="TCLR"/>
          <bitfield caption="ALE to Data Start" mask="0x000000F0" name="TADL"/>
          <bitfield caption="ALE to REN Low Delay" mask="0x00000F00" name="TAR"/>
          <bitfield caption="Off Chip Memory Scrambling Enable" mask="0x00001000" name="OCMS"/>
          <bitfield caption="Ready to REN Low Delay" mask="0x000F0000" name="TRR"/>
          <bitfield caption="WEN High to REN to Busy" mask="0x0F000000" name="TWB"/>
          <bitfield caption="Ready/Busy Line Selection" mask="0x70000000" name="RBNSEL"/>
          <bitfield caption="NAND Flash Selection" mask="0x80000000" name="NFSEL"/>
        </register>
        <register caption="SMC Mode Register (CS_number = 2)" name="SMC_MODE2" offset="0xA8" rw="RW" size="4">
          <bitfield caption="" mask="0x00000001" name="READ_MODE" values="SMC_MODE2__READ_MODE"/>
          <bitfield caption="" mask="0x00000002" name="WRITE_MODE" values="SMC_MODE2__WRITE_MODE"/>
          <bitfield caption="NWAIT Mode" mask="0x00000030" name="EXNW_MODE" values="SMC_MODE2__EXNW_MODE"/>
          <bitfield caption="Byte Access Type" mask="0x00000100" name="BAT"/>
          <bitfield caption="Data Bus Width" mask="0x00001000" name="DBW" values="SMC_MODE2__DBW"/>
          <bitfield caption="Data Float Time" mask="0x000F0000" name="TDF_CYCLES"/>
          <bitfield caption="TDF Optimization" mask="0x00100000" name="TDF_MODE"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 3)" name="SMC_SETUP3" offset="0xAC" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in Write Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in Read Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
