turbq/atprog/packs/atmel/SAM3U_DFP/1.0.49/atdf/ATSAM3U2E.atdf
        <register caption="UDPHS DMA Next Descriptor Address Register (channel = 5)" name="UDPHS_DMANXTDSC5" offset="0x350" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Address Register (channel = 5)" name="UDPHS_DMAADDRESS5" offset="0x354" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="UDPHS DMA Channel Control Register (channel = 5)" name="UDPHS_DMACONTROL5" offset="0x358" rw="RW" size="4">
          <bitfield caption="(Channel Enable Command)" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable (Command)" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable (Control)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable (Control)" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="UDPHS DMA Channel Status Register (channel = 5)" name="UDPHS_DMASTATUS5" offset="0x35C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
      </register-group>
      <value-group caption="" name="UDPHS_TST__SPEED_CFG">
        <value caption="Normal Mode: The macro is in Full Speed mode, ready to make a High Speed identification, if the host supports it and then to automatically switch to High Speed mode" name="NORMAL" value="0x0"/>
        <value caption="Force High Speed: Set this value to force the hardware to work in High Speed mode. Only for debug or test purpose." name="HIGH_SPEED" value="0x2"/>
        <value caption="Force Full Speed: Set this value to force the hardware to work only in Full Speed mode. In this configuration, the macro will not respond to a High Speed reset handshake." name="FULL_SPEED" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG0__EPT_SIZE">
        <value caption="8 bytes" name="_8" value="0x0"/>
        <value caption="16 bytes" name="_16" value="0x1"/>
        <value caption="32 bytes" name="_32" value="0x2"/>
        <value caption="64 bytes" name="_64" value="0x3"/>
        <value caption="128 bytes" name="_128" value="0x4"/>
        <value caption="256 bytes" name="_256" value="0x5"/>
        <value caption="512 bytes" name="_512" value="0x6"/>
        <value caption="1024 bytes" name="_1024" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG0__EPT_TYPE">
        <value caption="Control endpoint" name="CTRL8" value="0x0"/>
        <value caption="Isochronous endpoint" name="ISO" value="0x1"/>
        <value caption="Bulk endpoint" name="BULK" value="0x2"/>
        <value caption="Interrupt endpoint" name="INT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG0__BK_NUMBER">
        <value caption="Zero bank, the endpoint is not mapped in memory" name="_0" value="0x0"/>
        <value caption="One bank (bank 0)" name="_1" value="0x1"/>
        <value caption="Double bank (Ping-Pong: bank0/bank1)" name="_2" value="0x2"/>
        <value caption="Triple bank (bank0/bank1/bank2)" name="_3" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA0__TOGGLESQ_STA">
        <value caption="DATA0" name="DATA0" value="0x0"/>
        <value caption="DATA1" name="DATA1" value="0x1"/>
        <value caption="Reserved for High Bandwidth Isochronous Endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for High Bandwidth Isochronous Endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA0__BUSY_BANK_STA">
        <value caption="1 busy bank" name="_1BUSYBANK" value="0x0"/>
        <value caption="2 busy banks" name="_2BUSYBANKS" value="0x1"/>
        <value caption="3 busy banks" name="_3BUSYBANKS" value="0x2"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG1__EPT_SIZE">
        <value caption="8 bytes" name="_8" value="0x0"/>
        <value caption="16 bytes" name="_16" value="0x1"/>
        <value caption="32 bytes" name="_32" value="0x2"/>
        <value caption="64 bytes" name="_64" value="0x3"/>
        <value caption="128 bytes" name="_128" value="0x4"/>
        <value caption="256 bytes" name="_256" value="0x5"/>
        <value caption="512 bytes" name="_512" value="0x6"/>
        <value caption="1024 bytes" name="_1024" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG1__EPT_TYPE">
        <value caption="Control endpoint" name="CTRL8" value="0x0"/>
        <value caption="Isochronous endpoint" name="ISO" value="0x1"/>
        <value caption="Bulk endpoint" name="BULK" value="0x2"/>
        <value caption="Interrupt endpoint" name="INT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG1__BK_NUMBER">
        <value caption="Zero bank, the endpoint is not mapped in memory" name="_0" value="0x0"/>
        <value caption="One bank (bank 0)" name="_1" value="0x1"/>
        <value caption="Double bank (Ping-Pong: bank0/bank1)" name="_2" value="0x2"/>
        <value caption="Triple bank (bank0/bank1/bank2)" name="_3" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA1__TOGGLESQ_STA">
        <value caption="DATA0" name="DATA0" value="0x0"/>
        <value caption="DATA1" name="DATA1" value="0x1"/>
        <value caption="Reserved for High Bandwidth Isochronous Endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for High Bandwidth Isochronous Endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA1__BUSY_BANK_STA">
        <value caption="1 busy bank" name="_1BUSYBANK" value="0x0"/>
        <value caption="2 busy banks" name="_2BUSYBANKS" value="0x1"/>
        <value caption="3 busy banks" name="_3BUSYBANKS" value="0x2"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG2__EPT_SIZE">
        <value caption="8 bytes" name="_8" value="0x0"/>
        <value caption="16 bytes" name="_16" value="0x1"/>
        <value caption="32 bytes" name="_32" value="0x2"/>
        <value caption="64 bytes" name="_64" value="0x3"/>
        <value caption="128 bytes" name="_128" value="0x4"/>
        <value caption="256 bytes" name="_256" value="0x5"/>
        <value caption="512 bytes" name="_512" value="0x6"/>
        <value caption="1024 bytes" name="_1024" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG2__EPT_TYPE">
        <value caption="Control endpoint" name="CTRL8" value="0x0"/>
        <value caption="Isochronous endpoint" name="ISO" value="0x1"/>
        <value caption="Bulk endpoint" name="BULK" value="0x2"/>
        <value caption="Interrupt endpoint" name="INT" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTCFG2__BK_NUMBER">
        <value caption="Zero bank, the endpoint is not mapped in memory" name="_0" value="0x0"/>
        <value caption="One bank (bank 0)" name="_1" value="0x1"/>
        <value caption="Double bank (Ping-Pong: bank0/bank1)" name="_2" value="0x2"/>
        <value caption="Triple bank (bank0/bank1/bank2)" name="_3" value="0x3"/>
      </value-group>
      <value-group caption="" name="UDPHS_EPTSTA2__TOGGLESQ_STA">
        <value caption="DATA0" name="DATA0" value="0x0"/>
        <value caption="DATA1" name="DATA1" value="0x1"/>
        <value caption="Reserved for High Bandwidth Isochronous Endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for High Bandwidth Isochronous Endpoint" name="MDATA" value="0x3"/>
      </value-group>
